## Task 2 -7.14.2 DataFrames

In [15]:
import pandas as pd

In [50]:
scores_dict = {'will': [90, 80, 85], 
          'jarrod': [88, 92, 95], 
          'caleb': [86, 78, 82], 
          'shawn': [76, 84, 80], 
          'justin': [95, 91, 89]}

In [51]:
scores = pd.DataFrame.from_dict(scores, orient='index', columns=['Exam1', 'Exam2', 'Exam3']).T

In [52]:
scores

       will  jarrod  caleb  shawn  justin
Exam1    90      88     86     76      95
Exam2    80      92     78     84      91
Exam3    85      95     82     80      89

In [53]:
df = pd.DataFrame(scores)

In [54]:
df.index = ['Exam1','Exam2','Exam3']

In [55]:
pg = {'preeti':['ram','shyam', 'hari'],'sushmita':['khadka', 'kandel', 'sapkota'],'ranjita':['gauko', 'saharko', 'timalsina']}

In [56]:
bf = pd.DataFrame(pg)

In [57]:
pg

{'preeti': ['ram', 'shyam', 'hari'],
 'sushmita': ['khadka', 'kandel', 'sapkota'],
 'ranjita': ['gauko', 'saharko', 'timalsina']}

In [58]:
bf

  preeti sushmita    ranjita
0    ram   khadka      gauko
1  shyam   kandel    saharko
2   hari  sapkota  timalsina

In [59]:
scores['jarrod']

Exam1    88
Exam2    92
Exam3    95
Name: jarrod, dtype: int64

In [60]:
scores['will']

Exam1    90
Exam2    80
Exam3    85
Name: will, dtype: int64

In [66]:
scores.loc['Exam1']

will      90
jarrod    88
caleb     86
shawn     76
justin    95
Name: Exam1, dtype: int64

In [67]:
scores.iloc[1]

will      80
jarrod    92
caleb     78
shawn     84
justin    91
Name: Exam2, dtype: int64

In [68]:
scores.loc['Exam1':'Exam3']

       will  jarrod  caleb  shawn  justin
Exam1    90      88     86     76      95
Exam2    80      92     78     84      91
Exam3    85      95     82     80      89

scores.iloc[['Exam1','Exam3']]

In [71]:
scores.loc['Exam1':'Exam3',['caleb','justin']]

       caleb  justin
Exam1     86      95
Exam2     78      91
Exam3     82      89

In [72]:
scores.iloc[[0,2],0:3]

       will  jarrod  caleb
Exam1    90      88     86
Exam3    85      95     82

In [75]:
scores[scores>=75]

       will  jarrod  caleb  shawn  justin
Exam1    90      88     86     76      95
Exam2    80      92     78     84      91
Exam3    85      95     82     80      89

In [77]:
scores[(scores>80) & (scores<90)]

       will  jarrod  caleb  shawn  justin
Exam1   NaN    88.0   86.0    NaN     NaN
Exam2   NaN     NaN    NaN   84.0     NaN
Exam3  85.0     NaN   82.0    NaN    89.0

In [83]:
scores.at['Exam2','caleb']

78

In [84]:
scores.at['Exam3','justin']

89

In [85]:
scores.iat[2,0]

85

In [89]:
scores.iat[0,3]

76

In [90]:
scores.at['Exam2','shawn']=100

In [91]:
scores.at['Exam2','shawn']

100

In [92]:
scores.describe()

       will     jarrod  caleb       shawn     justin
count   3.0   3.000000    3.0    3.000000   3.000000
mean   85.0  91.666667   82.0   85.333333  91.666667
std     5.0   3.511885    4.0   12.858201   3.055050
min    80.0  88.000000   78.0   76.000000  89.000000
25%    82.5  90.000000   80.0   78.000000  90.000000
50%    85.0  92.000000   82.0   80.000000  91.000000
75%    87.5  93.500000   84.0   90.000000  93.000000
max    90.0  95.000000   86.0  100.000000  95.000000

In [94]:
scores.mean()

will      85.000000
jarrod    91.666667
caleb     82.000000
shawn     85.333333
justin    91.666667
dtype: float64

In [95]:
scores.T

        Exam1  Exam2  Exam3
will       90     80     85
jarrod     88     92     95
caleb      86     78     82
shawn      76    100     80
justin     95     91     89

In [97]:
scores.T.describe()

       Exam1       Exam2      Exam3
count    5.0    5.000000   5.000000
mean    87.0   88.200000  86.200000
std      7.0    9.121403   5.974948
min     76.0   78.000000  80.000000
25%     86.0   80.000000  82.000000
50%     88.0   91.000000  85.000000
75%     90.0   92.000000  89.000000
max     95.0  100.000000  95.000000

In [98]:
scores.T.mean()

Exam1    87.0
Exam2    88.2
Exam3    86.2
dtype: float64

In [99]:
scores.sort_index(ascending =False)

       will  jarrod  caleb  shawn  justin
Exam3    85      95     82     80      89
Exam2    80      92     78    100      91
Exam1    90      88     86     76      95

In [100]:
scores.sort_index(axis =1)

       caleb  jarrod  justin  shawn  will
Exam1     86      88      95     76    90
Exam2     78      92      91    100    80
Exam3     82      95      89     80    85

In [101]:
scores.sort_values(by='Exam2', axis=1, ascending=False)

       shawn  jarrod  justin  will  caleb
Exam1     76      88      95    90     86
Exam2    100      92      91    80     78
Exam3     80      95      89    85     82

In [102]:
scores.T.sort_values(by ='Exam3', ascending = False)

        Exam1  Exam2  Exam3
jarrod     88     92     95
justin     95     91     89
will       90     80     85
caleb      86     78     82
shawn      76    100     80

In [103]:
scores.loc['Exam3'].sort_values(ascending = False)

jarrod    95
justin    89
will      85
caleb     82
shawn     80
Name: Exam3, dtype: int64